{"items":[{"type":"story","id":"5e85cf66-6ebd-341f-875e-34e6f9382d4c","header":{"headline":"Amy Adams Breaks Down, Cries About Philip Seymour Hoffman During Inside the Actors Studio Appearance"},"credit":{"publicationDate":"3 hrs"},"cover_photo":{"img":{"src":"http://l4.yimg.com/uu/api/res/1.2/mdHuZ5gWSEqgqK.zP0uTSw--/aD00ODA7dz00NTc7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/USWeekly/1391714377_amy-adams-lg.jpg"}},"body":{"paras":[{"content":"<a href=\"http://www.usmagazine.com/celebrities/amy-adams\">Amy Adams</a> broke down in tears Wednesday, Feb. 5 during her NYC appearance on Inside the Actors Studio after the conversation turned to Philip Seymour Hoffman, an eyewitness tells <a href=\"http://www.usmagazine.com\">Us Weekly</a> of the Oscar nominee."},{"content":"<a href=\"http://www.usmagazine.com/celebrity-news/pictures/philip-seymour-hoffmans-greatest-movie-roles-201422/35599\">PHOTOS: Philip Seymour Hoffman's greatest film roles</a>"},{"content":"&quot;James Lipton asked her about working with Philip on Doubt and The Master … It hit a nerve with her,&quot; the insider tells Us. &quot;[Adams] was sobbing and couldn&#39;t finish most of her sentences.&quot;"},{"content":"&quot;Amy talked about how he was the greatest actor she had worked with, and couldn&#39;t even tell stories about him without crying,&quot; the eyewitness recalls. &quot;She said to the audience of acting students &#39;I wish you all could have had the chance to work with him.&#39;&quot;"},{"content":"<a href=\"http://www.usmagazine.com/celebrity-news/pictures/stars-who-have-gone-too-soon-200929/3614\">PHOTOS: Stars gone too soon</a>"},{"content":"The redhead, 39, who&#39;s up for a Best Actress Oscar nominee for her dazzling performance in David O. Russell&#39;s American Hustl e, first starred opposite Hoffman in the 2008 film, Doubt , alongside <a href=\"http://www.usmagazine.com/celebrities/viola-davis\">Viola Davis</a> and <a href=\"http://www.usmagazine.com/celebrities/meryl-streep\">Meryl Streep</a>. All four actors received Oscar nominations in 2009 for their performances."},{"content":"<a href=\"http://www.usmagazine.com/celebrity-news/pictures/celebrity-deaths-in-2013-stars-weve-lost-2013106/31095\">PHOTOS: Cory Monteith, James Gandolfini and more stars we lost last year</a>"},{"content":"Four years later, Adams joined Hoffman and Joaquin Phoenix in Paul Thomas Anderson&#39;s brooding 2012 post-World War II drama, The Master ; Adams played the wife of Hoffman&#39;s charismatic cult leader Lancaster Dodd. All three costars received Oscar nods for their roles."},{"content":"Like Adams, Hoffman&#39;s former costars have expressed their sadness over the beloved actor&#39;s passing and many have paid their respects to his family. In the days following his death, <a href=\"http://www.usmagazine.com/celebrities/cate-blanchett\">Cate Blanchett</a>, <a href=\"http://www.usmagazine.com/celebrities/justin-theroux\">Justin Theroux</a>, <a href=\"http://www.usmagazine.com/celebrities/michelle-williams\">Michelle Williams</a>, and Phoenix have <a href=\"http://www.usmagazine.com/celebrity-news/news/michelle-williams-mimi-odonnell-philip-seymour-hoffman-death-201462\">all been photographed</a> visiting the downtown Manhattan apartment of Mimi O&#39;Donnell, the estranged girlfriend of Hoffman and mother of his three children."},{"content":"<a href=\"http://www.usmagazine.com/celebrity-news/pictures/michelle-williams-life-without-heath-ledger-2013221/27740\">PHOTOS: Michelle Williams' Hollywood evolution</a>&nbsp;"},{"content":"Sources tell Us Adams pulled out of additional television appearances so she would not have to speak about her late friend.&nbsp;"},{"content":"Lipton&#39;s interview with the Golden Globe winner will air Wednesday, Feb. 19 at 8 p.m. EST on Bravo."},{"content":"This article originally appeared on Usmagazine.com: <a href=\"http://www.usmagazine.com/celebrity-news/news/amy-adams-cries-philip-seymour-hoffman-inside-the-actors-studio-201462\">Amy Adams Breaks Down, Cries About Philip Seymour Hoffman During Inside the Actors Studio Appearance</a>"}]}},{"type":"story","id":"4f852f6a-d0c3-3bb4-8a43-8a85efbe1ad6","header":{"headline":"Just Like That, the ‘Party of No’ Is Back"},"credit":{"byline":"rob_garver","publicationDate":"3 hrs"},"body":{"paras":[{"content":"With the passage of a compromise budget earlier this year and hopeful talk about limited legislative cooperation, the caricature of the Congressional Republicans as the “Party of No” was starting to fade slightly in Washington. Until Thursday, that is."},{"content":"Within the space of a few hours, Republicans put roadblocks in front of a pair of popular legislative proposals that supporters insist would create jobs, increase economic growth and alleviate a lot of human suffering."},{"content":"<a href=\"http://www.thefiscaltimes.com/Articles/2014/02/06/Despite-Economic-Benefits-GOP-Hardliners-Fight-Immigration-Reform\">Related: Despite Economic Benefits, GOP Hardliners Fight Immigration Reform</a>"},{"content":"In a press conference Thursday morning, House Majority Leader John Boehner dashed the expectations of those hoping an immigration reform bill could make its way through the divided Congress. A hard core of conservatives in Boehner’s conference would oppose almost any immigration reform acceptable to Senate Democrats, but Boehner blamed the problem on a lack of “trust” in President Obama."},{"content":"“There’s widespread doubt about whether this administration can be trusted to enforce our laws, and it’s going to be difficult to move any immigration legislation until that changes,” he told reporters."},{"content":"The announcement disappointed immigration reform advocates, but was just as likely to annoy economists. The Congressional Budget Office has estimated that comprehensive immigration reform would generate economic growth and shrink the federal deficit."},{"content":"Later on Thursday, in a vote that ended at 2:45 p.m., Republicans blocked the Senate from moving forward on a three-month extension of federal unemployment benefits. An extension of federal unemployment benefits expired December 28, and approximately 1.7 million long-term unemployed people who would have been eligible for the payments are now cut off."},{"content":"Related: Lawmakers Battle Over CBO Jobs Numbers"},{"content":"Democrats in the Senate had bowed to Republican demands that the extension be limited to three months and that it be paid for by reducing other spending. They also added a Republican provision barring millionaires from collecting the payments. Even if the Senate had cleared the procedural hurdle and approved the extension, getting the bill through the Republican-controlled House was expected to be a challenge."},{"content":"As with the announcement dimming the hopes for immigration reform, the Republican move to block unemployment insurance extension will not just upset the families who rely on those payments, but will bother economists as well. In a hearing on the country’s long-term budget outlook Wednesday, CBO Director Douglas Elmendorf told the House Budget Committee that the extension of benefits would help the economy and create an estimated 200,000 jobs."},{"content":"In the same press conference in which he said immigration reform was unlikely to pass the House, Speaker Boehner <a href=\"http://www.thefiscaltimes.com/Articles/2014/02/06/Boehner-Emphatic-There-Will-Be-No-Default-Debt\">said</a> that he was having trouble getting another major legislative priority, raising the federal debt limit, through his fractious caucus. A temporary suspension of the debt limit expires Friday, and Treasury Secretary Jack Lew has said that accounting maneuvers to prevent a government default would be exhausted by the end of the month."},{"content":"Boehner insisted that his members do not want a default, but Republicans have struggled to find agreement on what to demand from the president in exchange for raising the debt ceiling. So even when they aren’t the “Party of No,” Republicans are having difficulty in getting to “Yes.”"},{"content":"Top Reads from The Fiscal Times"}]}},{"type":"story","id":"c061ec3d-25d3-32ec-8e51-5cdfbaeb396e","header":{"headline":"Calif town&#39;s water shortage stokes fears of future"},"credit":{"byline":"jason_dearen,_associated_press","publicationDate":"8 hrs"},"cover_photo":{"img":{"src":"http://l1.yimg.com/uu/api/res/1.2/IVrGpsD2Ikvx57yUnubwdA--/aD0yODI7dz00ODA7YXBwaWQ9eXRhY2h5b24-/http://globalfinance.zenfs.com/images/US_AHTTP_AP_FINANCIALTIMES/038bb2cb371105054b0f6a7067008075_original.jpg"}},"body":{"paras":[{"content":"WILLITS, Calif. (AP) -- In this small logging town in Northern California&#39;s redwood country, small blue signs urging water conservation are almost everywhere you look."},{"content":"Just south of Willits, in one of the state&#39;s most verdant corners, crows and other birds peck at dry ground that should be covered in water at the city&#39;s Centennial Reservoir, which is less than a third full. The creek that feeds it has slowed to a trickle."},{"content":"&quot;It&#39;s common at this time of year for the water to be going over the cement wall right here. In fact, we&#39;d be standing in water,&quot; said Bruce Burton, a Willits city councilman, gesturing toward the small cement dam in the creek. &quot;In the 20 years I&#39;ve been in local government, we&#39;ve never experienced this kind of condition.&quot;"},{"content":"While rain is predicted through the weekend in the north and central parts of the state, California remains in the midst of an historic drought. The state&#39;s Department of Public Health says 17 rural areas including Willits — a town of about 5,000 that usually sees about 50 inches of rain a year — are dangerously low on water, and officials expect that number to grow."},{"content":"In addition to declaring a drought emergency, California has canceled water deliveries from the state&#39;s water system to farms and thirsty cities and shut down fishing in dozens of streams to protect imperiled salmon and steelhead."},{"content":"The emergency has become a disruption to everyday life in Willits, a Mendocino County locale known as the final resting place of the racehorse Seabiscuit. City leaders have banned lawn watering and car washing, mandated all residents cut water use dramatically and asked restaurants to serve the precious resource only upon request and to conserve, such as by using paper plates."},{"content":"While California sees cycles of drought normally, scientists say the dry weather since Oct. 1 appears to be unique in its severity."},{"content":"&quot;According to tree ring records, this water year, which began Oct. 1, really stands out as one of the worst single years in the last 500 years,&quot; said Lynn Ingram, author of &quot;The West Without Water&quot; and a University of California earth science professor."},{"content":"&quot;This year, the drought is impacting places more than we&#39;ve ever seen, at least that I&#39;ve come across in my research,&quot; she added."},{"content":"Of the 17 water-starved rural agencies, three are in rainy Mendocino County and are districts that rely largely on rainwater to fill their reservoirs. Other areas include parts of Fresno, Kern and Santa Cruz counties."},{"content":"After a record dry 2013, Mendocino County leaders were the first in California to declare a drought emergency, which they did on Jan. 7."},{"content":"Things are so scarce that the sheriff&#39;s office is on alert for water bandits. During the 2009-10 drought, authorities caught thieves pumping water from Lake Mendocino into trucks. The reservoir is currently about 37 percent full, according to county officials."},{"content":"&quot;Water theft is a big concern, so we&#39;re doing public announcements and have a line to call for reports to the sheriff&#39;s department,&quot; said Carre Brown, a Mendocino County supervisor. &quot;All deputies are on the watch.&quot;"},{"content":"Unlike many of the other communities facing water woes, Willits doesn&#39;t have readily accessible groundwater."},{"content":"Officials are racing to develop two groundwater wells within city limits, but the water in both sources is polluted by naturally occurring arsenic and other minerals, so the city needs an expensive treatment facility to make it potable. The state public health department is testing the water to help determine what kind of treatment is needed."},{"content":"Ron Owens, a spokesman for the state public health department, said officials are helping struggling towns like Willits identify other water options, like connecting with other water systems if need be. It also has some emergency funding available."},{"content":"Meantime, officials say people in the bucolic town seem to be following the mandatory conservation orders."},{"content":"Even the local coin-operated car wash is only offering recycled water."},{"content":"&quot;We have been rationing severely. No plants get watered. That&#39;s over. Turned off the toilet. I haven&#39;t washed my hair for two weeks,&quot; said Willits resident Andrea Onstad, who was washing her car Monday afternoon."},{"content":"A few blocks down at Gribaldo&#39;s diner on the city&#39;s Main Street, customers sat at tables with no water glasses. A sign on the wall warned of the drought emergency — water was only available upon request."},{"content":"The water shortage has changed everything for people in Willits — even how they spend their free time at home."},{"content":"At Jim Harden&#39;s house, his lawn is splotched with brown spots, and empty flower pots usually stuffed with colorful annuals are stacked high. He&#39;s even unhooked his drip irrigation system."},{"content":"&quot;We&#39;re very concerned. If we totally run out of water, what are we going to do? Go to another community?&quot; Harden, 78, said, standing in his small greenhouse. &quot;It&#39;s frightening.&quot;"},{"content":"___"},{"content":"Jason Dearen can be reached at http://www.twitter.com/JHDearen"}]}},{"type":"story","id":"bf1c2594-0874-39b9-886b-ed033c05c381","header":{"headline":"These California Drought Pictures Are Scary, And It’s Only Getting Worse"},"credit":{"byline":"pamela_engel","publicationDate":"1 days"},"body":{"paras":[{"content":"California <a href=\"http://www.usatoday.com/story/money/business/2014/02/04/california-drought-economy/5043691/\">is in the midst of extreme drought</a>, possibly its worst since the 1970s."},{"content":"The state is running out of water, <a href=\"http://www.latimes.com/business/la-fi-ranchers-drought-20140205,0,7724120.story#axzz2sThMnbsv\">some ranchers have been forced to kill off herds</a>&nbsp;they can&#39;t feed without native grass, and farmers are struggling to grow crops."},{"content":"Gov. Jerry Brown <a href=\"http://www.nbcbayarea.com/news/local/Gov-Jerry-Brown-Orders-Drought-Emergency-for-California-240818091.html\">declared a state of emergency</a> last week."},{"content":"There&#39;s <a href=\"http://www.forbes.com/sites/henrymiller/2014/02/05/a-thirst-for-a-technology-to-mitigate-californias-drought/\">no end in sight</a> for now, with the <a href=\"http://www.cpc.ncep.noaa.gov/products/expert_assessment/sdo_summary.html\">National Weather Service warning</a>that &quot;forecast confidence is high for drought persistence or intensification&quot; at least through April. The hot summer could be even worse."},{"content":"Satellite images from the National Oceanic and Atmospheric Administration <a href=\"http://www.nnvl.noaa.gov/MediaDetail2.php?MediaID=1483&MediaTypeID=1\">show the dramatic effect</a> drought has had on the state. In the photograph on the left, from last year, snow covers the&nbsp;Sierra Nevada mountain range. In the photograph on the right, the lush green space has been turned to dust and there&#39;s little snow to be seen:"},{"content":"<a href=\"http://www.nnvl.noaa.gov/MediaDetail2.php?MediaID=1483&MediaTypeID=1\">National Oceanic and Atmospheric Administration</a>"},{"content":"Some cities, like Santa Cruz, <a href=\"http://www.bloomberg.com/news/2014-02-04/sprinkers-run-dry-in-santa-cruz-amid-california-drought.html\">are imposing water restrictions</a> to preserve resources. Los Angeles is asking residents to reduce their water use by 20 percent."},{"content":"Timothy Quinn, executive director of the Association of California Water Agencies, told USA Today that &quot;the whole state is in crisis mode.&quot;"},{"content":"<a href=\"http://droughtmonitor.unl.edu/Home/StateDroughtMonitor.aspx?CA\">This map</a> from U.S. Drought Monitor shows how severe the drought is:"},{"content":"<a href=\"http://droughtmonitor.unl.edu/Home/StateDroughtMonitor.aspx?CA\">U.S. Drought Monitor</a>"},{"content":"Southern California has enough water stored up to get through this year and next year without implementing mandatory water reductions, according to USA Today, but some rural areas that depend on rainfall and reservoirs for their water have been forced to impose water limits on households."},{"content":"The small city of&nbsp;Willits, for example, has only 89 days of water left if it doesn&#39;t rain."},{"content":"Scientists<a href=\"http://news.msn.com/in-depth/scientists-past-california-droughts-have-lasted-200-years\">have warned about \"megadroughts\"</a> that could be returning to California, noting that some previous droughts in the state have lasted 10 to 20 years."},{"content":"Images from the state looks grim:"},{"content":"REUTERS/Robert Galbraith"},{"content":"The remains of an automobile is pictured on the bottom of the Almaden Reservoir near San Jose, California January 21, 2014."},{"content":"REUTERS/Robert Galbraith"},{"content":"A water pipe that normally carries water is shown above the nearly dry Almaden Reservoir near San Jose, California January 21, 2014."},{"content":"REUTERS/Robert Galbraith"},{"content":"Houseboats are docked at Bridge Bay in Shasta Lake, which is 100 feet (30 meters) below its normal levels, in Shasta, California January 23, 2014."},{"content":"REUTERS/Robert Galbraith"},{"content":"A sign is shown by an empty boat marina at Folsom Lake, which is 17 percent of its capacity, in Folsom, California January 22, 2014."},{"content":"REUTERS/Robert Galbraith"},{"content":"A visitor walks near the receding waters at Folsom Lake, which is 17 percent of its capacity, in Folsom, California January 22, 2014."}]}},{"type":"story","id":"ba10b3fd-ecdc-36a4-ad2b-56c13438ff6c","header":{"headline":"9 Decadent Valentine&#39;s Day Sweets for Your Sweetheart"},"credit":{"byline":"hgtv_family_of_sites","publicationDate":"3 hrs"},"cover_photo":{"img":{"src":"http://l4.yimg.com/uu/api/res/1.2/Ka7XV3E_FyfRxxv3GD.8EQ--/aD00ODA7dz0zNjA7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/blogs/partner/470_2756008.jpg"}},"body":{"paras":[{"content":"Chocolate Soup (for Two) Recipe  Chocolate soup is a fun and unexpected way to end Valentine&#39;s Day dinner. Silky and indulgent, this recipe generously serves two. Use bittersweet chocolate chips or your favorite brand of chocolate bar.   -By Heather Baird, Sprinkle Bakes"},{"content":"Ingredients  For the soup:  1 cup of whole milk  1 cup of half-and-half  1/3 cup fat-free sweetened condensed milk  2 teaspoons vanilla extract  1 cup bittersweet chocolate chips or 6 ounces bar chocolate, chopped  2 tablespoons cornstarch  2 tablespoons cold water   For the topping:  2 ounces low-fat cream cheese  3 heaping tablespoons marshmallow creme"},{"content":"Directions  For the soup:  1. In a saucepan over medium heat, stir together the milk, half-and-half, sweetened condensed milk and vanilla extract. Bring the mixture to a bubble.  2. Reduce heat to low and add the chocolate.  3. Let stand for 1 minute, then whisk until the chocolate starts to melt.  4. Combine the cornstarch and water with a fork or small whisk.  5. Add this mixture a little at a time, whisking constantly until the soup is thick and smooth. You&#39;ll know it&#39;s ready when the bubbles are gone and the chocolate has thickened; this takes about 5 to 7 minutes.  6. Carefully pour into two bowls and garnish.   For the topping:  1. Microwave the cream cheese at 10-second intervals or until it can be stirred smooth.  2. Add marshmallow creme to the cream cheese and mix well.  3. Dollop on top of soup, or transfer mixture to a pastry bag and pipe design."},{"content":"Chocolate-Covered Strawberry Cookie Truffles Recipe  Original chocolate truffles have graced birthday, potluck and holiday parties for years. These truffles provide a little twist on the classic recipe and combine everyone&#39;s favorite duo: chocolate and strawberries."},{"content":"-By Emily Roemmich, Busy Mommy"},{"content":"Ingredients  8 ounces cream cheese (regular or strawberry)  1/2 cup fresh strawberries, diced  1 package chocolate sandwich cookies  16 ounces baker&#39;s chocolate or almond bark, melted  sprinkles  small heart cookie cutter"},{"content":"Directions  1. Mix cream cheese and diced strawberries  2. Transfer chocolate sandwich cookies to a large freezer bag and crush. Then add the crushed cookies to the cream cheese mixture and spread into one side of a greased jelly roll pan, about 3/4-inch thick. Place the pan in the freezer for a few hours to harden  3. Melt the chocolate or almond bark in a saucepan.  4. Once the cookie mixture is hardened, use a heart cookie cutter to cut out each truffle.  5. Dip each truffle in the melted chocolate to cover. Be sure to tap off the excess chocolate. Then transfer the dipped truffle to parchment paper and top with sprinkles, if desired.  6. Store in an airtight container in the freezer or refrigerator.   Yield: Approximately 15-20 cookie truffles"},{"content":"Chocolate Brownie Pudding Recipe  This chocolate brownie pudding is the ultimate sinful treat. Somewhere between a brownie and a molten lava cake, this one is sure to satisfy any sweet tooth."},{"content":"-By Gaby Dalkin, What&#39;s Gaby Cooking"},{"content":"Ingredients  2 sticks unsalted butter  4 large eggs, at room temperature  2 cups white sugar  3/4 cup Dutch-processed cocoa powder  1/2 cup all-purpose flour  2 teaspoons pure vanilla extract  1 tablespoon Kahlua  vanilla ice cream, for serving"},{"content":"Directions  1. Preheat oven to 325 degrees F, and lightly butter a 9x9 baking dish.  2. Melt butter in a small saucepan and set aside to cool.  3. Sift cocoa powder and flour together in a medium bowl and set aside.  4. In a large stand mixer, beat eggs and sugar on medium-high for 5-10 minutes, until very thick and light yellow.  5. After 10 minutes, reduce speed to low and add vanilla, Kahlua and cocoa powder/flour mixture. Mix very slowly until everything is just combined. Slowly pour in cooled butter and mix again until just combined.  6. Pour mixture into baking dish and place on a large baking sheet. Add warm water to baking sheet so water comes up the side of the baking dish.  7. Carefully place into oven, making sure not to slosh water around and bake for 1 hour.  8. When it&#39;s time to remove -- don&#39;t worry -- it&#39;s going to look like it&#39;s under-baked (that&#39;s normal). Remove from the water and place in the refrigerator to cool. Serve with ice cream, if desired."},{"content":"Giant M&amp;M Cookies Recipe  Try this nostalgic cookie recipe that mixes M&amp;M&#39;s into classic sugar cookie dough for a treat that&#39;s soft, chewy and delicious as ever."},{"content":"-By Gaby Dalkin, What&#39;s Gaby Cooking"},{"content":"Ingredients  1 cup unsalted butter at room temperature  1/2 cup brown sugar  1 1/2 cups white sugar  2 eggs  2 1/2 teaspoons vanilla extract  2 1/2 cups all-purpose flour  1 teaspoon salt  1 teaspoon baking soda  1 teaspoon baking powder  half bag of red, white and pink M&amp;M&#39;s   Directions  1. Preheat your oven to 350 degrees F.  2. Cream together butter and sugars in a mixer for 2-3 minutes.  3. Add eggs and vanilla, making sure to scrape down sides of mixing bowl so everything is evenly incorporated.  4. Add flour, salt, baking soda and baking powder and mix on low until everything is just incorporated, making sure not to overmix.  5. Chill dough in the refrigerator for at least 45 minutes and up to 4 hours. While dough is chilling, place the M&amp;M&#39;s into a wide, shallow bowl.  6. Scoop out a 1/4-cup size of dough, and roll it into a ball. Roll it around in the M&amp;M&#39;s and place on a parchment-lined baking sheet.  7. Place 6 cookies on a sheet. Note: They will spread due to their size, so it&#39;s better to bake fewer at a time so they don&#39;t run together.  8. Bake for 12-14 minutes until just slightly golden around the edges. Remove from oven and let cool on the baking sheet for about 5 minutes more. Remove cookies from baking sheet and transfer to a wire rack to cool. Repeat this process for the remaining dough."},{"content":"Port Wine Lollipop Recipe  Red wine is an unexpected ingredient to incorporate into desserts. These lollipops were created with Port wine, but you can experiment with your favorite variety of red."},{"content":"-By Heather Baird, SprinkleBakes"},{"content":"Ingredients and Materials  1 1/2 cups + 2 tablespoons Port wine  3 tablespoons corn syrup  3/4 cup sugar  1/8 teaspoons kosher salt  12 lollipop sticks  gold luster dust (optional)  hard candy lollipop molds or a silicone mat  lollipop sticks  candy thermometer   Directions  1. Bring red wine to a simmer in a small saucepan (Image 1). Simmer wine until reduced to 1/3 cup. This should take about 20-25 minutes. Remove from stovetop and let cool completely.  2. In a medium saucepan combine sugar, corn syrup, salt and wine reduction. Stir until combined.  3. Clip a candy thermometer to the side of the saucepan and bring to a boil over medium heat.  4. Stir occasionally with a heatproof spatula until all sugar granules have dissolved.  5. Boil until candy temperature registers 298-310 degrees F on a candy thermometer.  6. Remove from heat and fill greased lollipop molds with the hot candy.  7. Place lollipop sticks in the stick crevices and rotate until the stick is coated in the hot candy. Alternatively, you may also drop the hot candy from a spoon onto a silicone mat or parchment paper, making two- to three-inch disks and leaving room to place -- and rotate -- the lollipop sticks.  8. Allow the lollipops to harden completely.  9. These are best if you wait a day to consume them, as this gives the red wine flavor plenty of time to develop.  10. Embellish with luster dust, if desired, and store between sheets of parchment paper in an airtight container."},{"content":"Cupid&#39;s Crispie Treats Recipe  These little crispie treats are spiced up just a bit with the addition of cinnamon imperials. We gave ours a sweet twist by inserting arrows straight from Cupid&#39;s bow.   -By Sam Henderson, Today&#39;s Nest"},{"content":"Ingredients  3 tablespoons unsalted butter  4 cups miniature marshmallows  6 cups crisp rice cereal  1/2 cup cinnamon imperials"},{"content":"Directions  1. Line a baking sheet with parchment paper and set aside.  2. Melt butter in a large saucepan over medium heat. Add marshmallows and stir continuously until melted.  3. Add cereal and stir until completely incorporated.  4. Add cinnamon candies and incorporate fully.  5. Apply a small amount of butter to your hands. Gather enough mixture to make one-inch balls and roll, squeezing gently.  6. If none of the candies make it to the surface, poke in a few that have fallen to the bottom of the bowl.  7. Store in an airtight container.  8. Before serving, insert arrow (made with a skewer and fringed chevron-shaped paper) in the very center of each crispie."},{"content":"Cupid&#39;s Arrow Hot Chocolate  Surprise your Valentine with a cup of hot chocolate dressed up with a paper straw &quot;arrow&quot; and a heart-shaped marshmallow (cut out with cookie cutters). Kids and adults alike will love this new twist on a classic winter treat."},{"content":"-By Liz Gray"},{"content":"Spiced Hot Chocolate Mix  Makes 5-1/2 cups hot chocolate mix"},{"content":"Ingredients  1-3/4 cups powdered sugar  1 cup cocoa  2-1/2 cups powdered milk  1 teaspoon salt  2 teaspoons cornstarch  1/2 teaspoon cayenne pepper  2 teaspoons cinnamon  1 teaspoon garam masala (optional)  vanilla extract, for serving (optional)  hot water or milk, for serving"},{"content":"Directions  In a large bowl, whisk together all dry ingredients. Store in an airtight container. When ready to use, fill your mug 1/3 of the way with hot chocolate mix. Add enough hot water or milk just to cover, then whisk to remove any lumps. Add a splash of vanilla, if desired. Fill the rest of the way with water or milk."},{"content":"White-Chocolate-Dipped Fortune Cookies  Delight your valentine with white-chocolate-dipped fortune cookies in a crafty (and cute!) Chinese takeout box.   -By H. Camille Smith"},{"content":"Ingredients and Materials Needed:  white chocolate chips  fortune cookies  candy heart-shaped sprinkles  microwave-safe glass container  wax paper"},{"content":"Directions  Pour white chocolate chips into a microwave-safe container and place in microwave. Using a low power setting, melt chocolate chips, stirring frequently. Note: Alternatively, you can use a double-boiler to melt the white chocolate chips. Holding one end, dip a fortune cookie into chocolate and place on wax paper. While chocolate is still wet, press candy hearts onto chocolate. Continue dipping cookies until you have enough to fill box."},{"content":"Pink Champagne Truffles Recipe  Make your Valentine&#39;s Day even sweeter with pink champagne truffles. Display them in foil candy papers for extra eye appeal."},{"content":"-By Heather Baird, SprinkleBakes"},{"content":"Yield: Makes 12 small toasting truffles"},{"content":"Ingredients  7 oz. high-quality white chocolate, chopped  1 cup pink champagne such as KORBEL Brut Ros&eacute;  2 tablespoons heavy cream  1 teaspoon red flavored gelatin (strawberry or raspberry)  Confectioners&#39; sugar"},{"content":"Directions  1. Pour the pink champagne into a small saucepan and bring to a boil. Reduce heat and simmer until champagne has reduced to 1 teaspoon. Set aside and let cool slightly.  2. Set a heatproof bowl over a small pot of simmering water. Add the heavy cream and champagne reduction to the bowl and stir until combined and hot. Gradually add the white chocolate and stir until melted and smooth.  3. Sprinkle over the gelatin and mix with a rubber spatula until combined. Mixture will thicken slightly and a little of the cocoa butter may rise to the top - pour this off. Cover and chill.  4. Check for firmness at 5-10 minutes. This mixture firms up quickly and should not be left in the refrigerator for too long.  5. Roll the scooped chocolate with your hands into small balls (about the size of a large grape) and roll into powdered sugar. Serve truffles in fancy candy foils with a glass of champagne for the toast."},{"content":"MORE FROM HGTV FAMILY OF SITES  <a href=\"http://www.hgtvremodels.com/building-of-the-dream-home-2014/package/index.html?syc=yahoo_rel\">Do You Want to Win HGTV's Dream Home?</a>  <a href=\"http://www.frontdoor.com/photos/tour-taylor-swifts-childhood-home?syc=yahoo_rel\">Before Taylor Swift Was Famous, She Lived Here</a>  <a href=\"http://www.hgtvgardens.com/swimming-pools/25-stellar-celebrity-pools?syc=yahoo_rel\">25 Hollywood Stars' Out-of-This-World Swimming Pools</a>  <a href=\"http://www.diynetwork.com/quick-cleaning-tips/package/index.html?syc=yahoo_rel\">Genius Speed Cleaning Tips & Tricks From the Pros</a>"},{"content":"-Compiled by Kayla Kitts for HGTV.com"}]}}]}